balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ64GB002.PIC
        <edc:SFRDef edc:access="nnn-----------nn" edc:cname="SPI1CON2" edc:desc="" edc:impl="0xe003" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-----------00" edc:name="SPI1CON2" edc:nzwidth="0x10" edc:por="000-----------00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPIBEN" edc:desc="" edc:mask="0x1" edc:name="SPIBEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPIFE" edc:desc="" edc:mask="0x1" edc:name="SPIFE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="11"/>
              <edc:SFRFieldDef edc:cname="SPIFPOL" edc:desc="" edc:mask="0x1" edc:name="SPIFPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPIFSD" edc:desc="" edc:mask="0x1" edc:name="SPIFSD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FRMEN" edc:desc="" edc:mask="0x1" edc:name="FRMEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="SPI1BUF" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="SPI1BUF" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI1BUF" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="SPI1BUF" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="22"/>
        <edc:SFRDef edc:access="n-n--rrrrcrnnnrr" edc:cname="SPI2STAT" edc:desc="" edc:impl="0xa743" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0--00000000000" edc:name="SPI2STAT" edc:nzwidth="0x10" edc:por="0-0--00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPIRBF" edc:desc="" edc:mask="0x1" edc:name="SPIRBF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPITBF" edc:desc="" edc:mask="0x1" edc:name="SPITBF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SISEL" edc:desc="" edc:mask="0x7" edc:name="SISEL" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="SRXMPT" edc:desc="" edc:mask="0x1" edc:name="SRXMPT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPIROV" edc:desc="" edc:mask="0x1" edc:name="SPIROV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRMPT" edc:desc="" edc:mask="0x1" edc:name="SRMPT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPIBEC" edc:desc="" edc:mask="0x7" edc:name="SPIBEC" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SPISIDL" edc:desc="" edc:mask="0x1" edc:name="SPISIDL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SPIEN" edc:desc="" edc:mask="0x1" edc:name="SPIEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SISEL0" edc:desc="" edc:mask="0x1" edc:name="SISEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SISEL1" edc:desc="" edc:mask="0x1" edc:name="SISEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SISEL2" edc:desc="" edc:mask="0x1" edc:name="SISEL2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="SPIBEC0" edc:desc="" edc:mask="0x1" edc:name="SPIBEC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPIBEC1" edc:desc="" edc:mask="0x1" edc:name="SPIBEC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPIBEC2" edc:desc="" edc:mask="0x1" edc:name="SPIBEC2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="SPI 2" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnnnnnnnnnn" edc:cname="SPI2CON1" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---0000000000000" edc:name="SPI2CON1" edc:nzwidth="0x10" edc:por="---0000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PPRE" edc:desc="" edc:mask="0x3" edc:name="PPRE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="SPRE" edc:desc="" edc:mask="0x7" edc:name="SPRE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="MSTEN" edc:desc="" edc:mask="0x1" edc:name="MSTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKP" edc:desc="" edc:mask="0x1" edc:name="CKP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSEN" edc:desc="" edc:mask="0x1" edc:name="SSEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKE" edc:desc="" edc:mask="0x1" edc:name="CKE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMP" edc:desc="" edc:mask="0x1" edc:name="SMP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MODE16" edc:desc="" edc:mask="0x1" edc:name="MODE16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DISSDO" edc:desc="" edc:mask="0x1" edc:name="DISSDO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DISSCK" edc:desc="" edc:mask="0x1" edc:name="DISSCK" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PPRE0" edc:desc="" edc:mask="0x1" edc:name="PPRE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PPRE1" edc:desc="" edc:mask="0x1" edc:name="PPRE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPRE0" edc:desc="" edc:mask="0x1" edc:name="SPRE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPRE1" edc:desc="" edc:mask="0x1" edc:name="SPRE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPRE2" edc:desc="" edc:mask="0x1" edc:name="SPRE2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
